Kenya’s goal is to reach 100% electricity connectivity by 2022. This is to enable a green economy run by 100% sustainable energy in terms of electricity generation and consumption. Additionally, in accordance with the Paris Agreement, Kenya committed itself to tackling climate change. The country’s determined contribution (National Determined Contribution), which is pegged on the 2013 Kenya Climate Change Action Plan, promises to reduce greenhouse gas (GHG) emissions by 30% by 2030 from 2015 (Ministry
of Environment and Natural Resources 2015).

The goal of this project is to determine what the current consumption of electricity is, type of energy source and how does it compare over the duration of the data and the Vision 2030 goals?

# DATA PREPARATION

In [ ]:
# Loading libraries into our environment

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
# Loading the datasets into the environment

Energy_2020 = pd.read_csv('Energy_Main_Lighting_Energy_Sources.csv')
Energy_2017 = pd.read_csv('Main_Lighting_Energy_Sources_averaged_to_Districts_in_2009.csv')

In [ ]:
# Previewing Energy 2020
Energy_2020.head()

   OBJECTID   County  ...  Shape_Length  Shape_Area
0         1  BARINGO  ...      6.333111    0.888242
1         2    BOMET  ...      2.101561    0.116672
2         3  BUNGOMA  ...      3.173881    0.244750
3         4    BUSIA  ...      3.009087    0.136848
4         5     EMBU  ...      3.373973    0.227949

[5 rows x 21 columns]

In [ ]:
# Previewing Energy 2017
Energy_2017.head()

         _District Rural_/_Urban  ...                  Geolocation OBJECTID
0     MERU CENTRAL         Urban  ...   (0.001443681, 37.58330732)        0
1   KAKAMEGA SOUTH         Urban  ...    (0.190561619, 34.7077479)        1
2  NYANDARUA NORTH         Urban  ...  (-0.144560572, 36.42343108)        2
3  NYANDARUA SOUTH         Urban  ...  (-0.533045224, 36.55651343)        3
4      NYERI NORTH         Urban  ...   (-0.266587082, 36.9811441)        4

[5 rows x 28 columns]

In [ ]:
# Understanding the information contained in Energy 2020 columns
Energy_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 21 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   OBJECTID                                 47 non-null     int64
 1   County                                   47 non-null     object
 2   Electricty_percentage                    47 non-null     int64
 3   Pressure_Lamp_percentage                 47 non-null     int64
 4   Lantern_percentage                       47 non-null     int64
 5   Tin_Lamp_percebntage                     47 non-null     int64
 6   Gas_Lamp_percentage                      47 non-null     int64
 7   Fuel_wood_percentage                     47 non-null     int64
 8   Solar_percentage                         47 non-null     int64
 9   Other_Lighting_percentage                47 non-null     int64
 10  Number_of_households_with_electricity    47 non-null     int64
 11  Number_of_households_with_Pressure_Lamp  47 non-null     int64
 12  Number_of_households_with_Lantern        47 non-null     int64
 13  Number_of_households_with_Tin_Lamp       47 non-null     int64
 14  Number_of_households_with_Gas_Lamp       47 non-null     int64
 15  Number_of_households_with_Fuel_wood      47 non-null     int64
 16  Number_of_households_with_Solar          47 non-null     int64
 17  Number_of_households_with_Other          47 non-null     int64
 18  Households                               47 non-null     int64
 19  Shape_Length                             47 non-null     float64
 20  Shape_Area                               47 non-null     float64
dtypes: float64(2), int64(18), object(1)
memory usage: 7.8+ KB

In [ ]:
# Understanding the information contained in Energy 2017 columns
Energy_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316 entries, 0 to 315
Data columns (total 28 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   _District                            316 non-null    object
 1   Rural_/_Urban                        316 non-null    object
 2   %_of_households_with_electricty      290 non-null    object
 3   %_of_households_with_Pressure_Lamp   290 non-null    object
 4   %_of_households_with_Lantern         290 non-null    object
 5   %_of_households_with_Tin_Lamp        290 non-null    object
 6   %_of_households_with_Gas_Lamp        290 non-null    object
 7   %_of_households_with_Fuel_wood       290 non-null    object
 8   %_of_households_with_Solar           290 non-null    object
 9   %_of_households_with_Other           290 non-null    object
 10  Housheolds                           316 non-null    int64
 11  No_of_households_with_electricity    316 non-null    int64
 12  No_of_households_with_Pressure_Lamp  316 non-null    int64
 13  No_of_households_with_Lantern        316 non-null    int64
 14  No_of_households_with_Tin_Lamp       316 non-null    int64
 15  No_of_households_with_Gas_Lamp       316 non-null    int64
 16  No_of_households_with_Fuel_wood      316 non-null    int64
 17  No_of_households_with_Solar          316 non-null    int64
 18  No_of_households_with_Other          316 non-null    int64
 19  Province                             316 non-null    object
 20  County                               316 non-null    object
 21  Census_Table                         316 non-null    object
 22  MTEF                                 316 non-null    object
 23  MTP                                  316 non-null    object
 24  Longtitude                           314 non-null    float64
 25  Latitude                             314 non-null    float64
 26  Geolocation                          314 non-null    object
 27  OBJECTID                             316 non-null    int64
dtypes: float64(2), int64(10), object(16)
memory usage: 69.2+ KB

In [ ]:
# Dropping unrequired fields from Energy 2020

Energy_2020.drop(['Electricty_percentage', 'Pressure_Lamp_percentage', 'Lantern_percentage', 'Tin_Lamp_percebntage', 'Gas_Lamp_percentage', 'Fuel_wood_percentage', 'Solar_percentage', 'Other_Lighting_percentage'], axis= 1, inplace= True)
Energy_2020.drop(['OBJECTID','Shape_Length', 'Shape_Area'], axis= 1, inplace= True)

In [ ]:
# Dropping unrequired fields from Energy 2017
Energy_2017.drop(['%_of_households_with_electricty', '%_of_households_with_Pressure_Lamp', '%_of_households_with_Lantern', '%_of_households_with_Tin_Lamp', '%_of_households_with_Gas_Lamp', '%_of_households_with_Fuel_wood'], axis= 1, inplace= True)
Energy_2017.drop(['%_of_households_with_Solar', '%_of_households_with_Other', 'Province', 'Census_Table', 'MTEF', 'MTP', 'Longtitude', 'Latitude', 'Geolocation', 'OBJECTID'], axis= 1, inplace= True)

In [ ]:
# Viewing the new table Energy 2020
Energy_2020.head()

    County  ...  Households
0  BARINGO  ...      110649
1    BOMET  ...      174914
2  BUNGOMA  ...      270824
3    BUSIA  ...      154225
4     EMBU  ...       77555

[5 rows x 10 columns]

In [ ]:
# Viewing the new table Energy 2017
Energy_2017.head()

         _District Rural_/_Urban  ...  No_of_households_with_Other     County
0     MERU CENTRAL         Urban  ...                            0       Meru
1   KAKAMEGA SOUTH         Urban  ...                            0   Kakamega
2  NYANDARUA NORTH         Urban  ...                          120  Nyandarua
3  NYANDARUA SOUTH         Urban  ...                           88  Nyandarua
4      NYERI NORTH         Urban  ...                          155      Nyeri

[5 rows x 12 columns]

In [ ]:
# Making the data consistent
Energy_2020.columns = Energy_2020.columns.str.replace('Number','No')
Energy_2017.drop('Rural_/_Urban', axis= 1, inplace= True)

In [ ]:
# Prepared Table for Energy 2020
Energy_2020.head()

    County  ...  Households
0  BARINGO  ...      110649
1    BOMET  ...      174914
2  BUNGOMA  ...      270824
3    BUSIA  ...      154225
4     EMBU  ...       77555

[5 rows x 10 columns]

In [ ]:
# Prepared Table for Energy 2017
Energy_2017.head()

         _District  Housheolds  ...  No_of_households_with_Other     County
0     MERU CENTRAL           0  ...                            0       Meru
1   KAKAMEGA SOUTH           0  ...                            0   Kakamega
2  NYANDARUA NORTH       52503  ...                          120  Nyandarua
3  NYANDARUA SOUTH       61936  ...                           88  Nyandarua
4      NYERI NORTH       81307  ...                          155      Nyeri

[5 rows x 11 columns]

# DATA CLEANING

## Validity of the data

In [ ]:
#2017 dataset column name rectification
Energy_2017.rename(columns= {'Housheolds': 'Households'}, inplace = True)
Energy_2017.head(2)

        _District  Households  ...  No_of_households_with_Other    County
0    MERU CENTRAL           0  ...                            0      Meru
1  KAKAMEGA SOUTH           0  ...                            0  Kakamega

[2 rows x 11 columns]

In [ ]:
#Using the str.strip function on the column name to strip any leading and trailing spaces  
Energy_2017['County'] = Energy_2017['County'].str.strip()
Energy_2020['County'] = Energy_2020['County'].str.strip()

# Displaying the resulting dataframe
Energy_2017.head(4)
Energy_2020.head(2)

#checking for errors/anomalies in records
Energy_2017['County'].unique()
Energy_2020['County'].unique()

array(['BARINGO', 'BOMET', 'BUNGOMA', 'BUSIA', 'EMBU', 'GARISSA',
       'HOMABAY', 'ISIOLO', 'KAJIADO', 'KAKAMEGA', 'ELGEYO-MARAKWET',
       'KERICHO', 'KIAMBU', 'KILIFI', 'KIRINYAGA', 'KISII', 'KISUMU',
       'KITUI', 'KWALE', 'LAIKIPIA', 'LAMU', 'MACHAKOS', 'MAKUENI',
       'MANDERA', 'MARSABIT', 'MERU', 'MIGORI', 'MOMBASA', 'MURANGA',
       'NAIROBI', 'NAKURU', 'NANDI', 'NAROK', 'NYAMIRA', 'NYANDARUA',
       'NYERI', 'SAMBURU', 'SIAYA', 'TAITA-TAVETA', 'TANA-RIVER',
       'THARAKA-NITHI', 'TRANS-NZOIA', 'TURKANA', 'UASIN-GISHU', 'VIHIGA',
       'WAJIR', 'WEST POKOT'], dtype=object)

In [ ]:
#Using str.replace() function on the respective 2017 column to remove the apostrophe Murang'a 
# 

Energy_2017['County'] = Energy_2017['County'].str.replace("'","")

# Displaying the resulting dataframe
Energy_2017['County'].unique()

array(['Meru', 'Kakamega', 'Nyandarua', 'Nyeri', 'Kirinyaga', 'Muranga',
       'Kiambu', 'Mombasa', 'Kwale', 'Kilifi', 'Tana River', 'Lamu',
       'Taita Taveta', 'Marsabit', 'Isiolo', 'Tharaka Nithi', 'Embu',
       'Kitui', 'Machakos', 'West Pokot', 'Makueni', 'Nairobi', 'Garissa',
       'Wajir', 'Mandera', 'Siaya', 'Kisumu', 'Homa Bay', 'Migori',
       'Kisii', 'Nyamira', 'Turkana', 'Samburu', 'Trans Nzoia', 'Baringo',
       'Uasin Gishu', 'Elgeyo Marakwet', 'Nandi', 'Laikipia', 'Nakuru',
       'Narok', 'Kajiado', 'Kericho', 'Bomet', 'Vihiga', 'Bungoma',
       'Busia'], dtype=object)

In [ ]:
#Using str.replace() function on the respective 2020 column to remove the hyphens 
# 

Energy_2020['County'] = Energy_2020['County'].str.replace("-"," ")

# Displaying the resulting dataframe
Energy_2020['County'].unique()

array(['BARINGO', 'BOMET', 'BUNGOMA', 'BUSIA', 'EMBU', 'GARISSA',
       'HOMABAY', 'ISIOLO', 'KAJIADO', 'KAKAMEGA', 'ELGEYO MARAKWET',
       'KERICHO', 'KIAMBU', 'KILIFI', 'KIRINYAGA', 'KISII', 'KISUMU',
       'KITUI', 'KWALE', 'LAIKIPIA', 'LAMU', 'MACHAKOS', 'MAKUENI',
       'MANDERA', 'MARSABIT', 'MERU', 'MIGORI', 'MOMBASA', 'MURANGA',
       'NAIROBI', 'NAKURU', 'NANDI', 'NAROK', 'NYAMIRA', 'NYANDARUA',
       'NYERI', 'SAMBURU', 'SIAYA', 'TAITA TAVETA', 'TANA RIVER',
       'THARAKA NITHI', 'TRANS NZOIA', 'TURKANA', 'UASIN GISHU', 'VIHIGA',
       'WAJIR', 'WEST POKOT'], dtype=object)

## Accuracy of the data

In [ ]:
Energy_2017.head(1)

      _District  Households  ...  No_of_households_with_Other  County
0  MERU CENTRAL           0  ...                            0    Meru

[1 rows x 11 columns]

In [ ]:
# In-record & cross-datasets error checks
#2017 dataset accuracy check
e = Energy_2017['No_of_households_with_electricity'] + Energy_2017['No_of_households_with_Pressure_Lamp'] +Energy_2017['No_of_households_with_Lantern'] + Energy_2017['No_of_households_with_Tin_Lamp'] + Energy_2017['No_of_households_with_Gas_Lamp'] + Energy_2017['No_of_households_with_Fuel_wood'] + Energy_2017['No_of_households_with_Solar'] + Energy_2017['No_of_households_with_Other']
Energy_2017[Energy_2017['Households'] != e]

Empty DataFrame
Columns: [_District, Households, No_of_households_with_electricity, No_of_households_with_Pressure_Lamp, No_of_households_with_Lantern, No_of_households_with_Tin_Lamp, No_of_households_with_Gas_Lamp, No_of_households_with_Fuel_wood, No_of_households_with_Solar, No_of_households_with_Other, County]
Index: []

In [ ]:
# In-record & cross-datasets error checks
#2020 dataset accuracy check
e1 = Energy_2020['No_of_households_with_electricity'] + Energy_2020['No_of_households_with_Pressure_Lamp'] +Energy_2020['No_of_households_with_Lantern'] + Energy_2020['No_of_households_with_Tin_Lamp'] + Energy_2020['No_of_households_with_Gas_Lamp'] + Energy_2020['No_of_households_with_Fuel_wood'] + Energy_2020['No_of_households_with_Solar'] + Energy_2020['No_of_households_with_Other']
Energy_2020[Energy_2020['Households'] != e1]

Empty DataFrame
Columns: [County, No_of_households_with_electricity, No_of_households_with_Pressure_Lamp, No_of_households_with_Lantern, No_of_households_with_Tin_Lamp, No_of_households_with_Gas_Lamp, No_of_households_with_Fuel_wood, No_of_households_with_Solar, No_of_households_with_Other, Households]
Index: []

## Completeness of the data

In [ ]:
# Checking if there is any missing value in 2017 dataset as a whole
Energy_2017.isnull().any()

# Checking if there is any missing value in 2020 dataset as a whole
Energy_2020.isnull().any()


# Checking if there is any missing value across each column and if so how many
# 2017 dataset
Energy_2017.isnull().sum()
# 2020 dataset
Energy_2020.isnull().sum()

County                                 0
No_of_households_with_electricity      0
No_of_households_with_Pressure_Lamp    0
No_of_households_with_Lantern          0
No_of_households_with_Tin_Lamp         0
No_of_households_with_Gas_Lamp         0
No_of_households_with_Fuel_wood        0
No_of_households_with_Solar            0
No_of_households_with_Other            0
Households                             0
dtype: int64

## Consistency of the data

In [ ]:
Energy_2017.head(1)

      _District  Households  ...  No_of_households_with_Other  County
0  MERU CENTRAL           0  ...                            0    Meru

[1 rows x 11 columns]

In [ ]:
#Checking for duplicates
#2017 dataset (used households since some district names were duplicated but not the records)
Energy_2017[Energy_2017['Households'].duplicated() ==True]
#Rachuonyo was ignored because its household numbers different values
#Energy_2017[Energy_2017.duplicated(['_District'])==True].sort_values('_District')

#2020 dataset
Energy_2020[Energy_2020['County'].duplicated() ==True]

Empty DataFrame
Columns: [County, No_of_households_with_electricity, No_of_households_with_Pressure_Lamp, No_of_households_with_Lantern, No_of_households_with_Tin_Lamp, No_of_households_with_Gas_Lamp, No_of_households_with_Fuel_wood, No_of_households_with_Solar, No_of_households_with_Other, Households]
Index: []

## Uniformity of the data

In [ ]:
#Standardization of column names
#Using strip(), lower() and replace() functions 
#2017 dataset
Energy_2017.columns = Energy_2017.columns.str.strip().str.lower()
Energy_2017.head(1)

#2020 dataset
Energy_2020.columns = Energy_2020.columns.str.strip().str.lower()
Energy_2020.head(1)

    county  ...  households
0  BARINGO  ...      110649

[1 rows x 10 columns]

In [ ]:
#checking data types
#2017 dataset
Energy_2017.info()

#2020 dataset
Energy_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316 entries, 0 to 315
Data columns (total 11 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   _district                            316 non-null    object
 1   households                           316 non-null    int64
 2   no_of_households_with_electricity    316 non-null    int64
 3   no_of_households_with_pressure_lamp  316 non-null    int64
 4   no_of_households_with_lantern        316 non-null    int64
 5   no_of_households_with_tin_lamp       316 non-null    int64
 6   no_of_households_with_gas_lamp       316 non-null    int64
 7   no_of_households_with_fuel_wood      316 non-null    int64
 8   no_of_households_with_solar          316 non-null    int64
 9   no_of_households_with_other          316 non-null    int64
 10  county                               316 non-null    object
dtypes: int64(9), object(2)
memory usage: 27.3+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 10 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   county                               47 non-null     object
 1   no_of_households_with_electricity    47 non-null     int64
 2   no_of_households_with_pressure_lamp  47 non-null     int64
 3   no_of_households_with_lantern        47 non-null     int64
 4   no_of_households_with_tin_lamp       47 non-null     int64
 5   no_of_households_with_gas_lamp       47 non-null     int64
 6   no_of_households_with_fuel_wood      47 non-null     int64
 7   no_of_households_with_solar          47 non-null     int64
 8   no_of_households_with_other          47 non-null     int64
 9   households                           47 non-null     int64
dtypes: int64(9), object(1)
memory usage: 3.8+ KB

In [ ]:
#2017 dataset group by to create a dataset of counties only like the 2020 datset
#Energy1_2017 = Energy_2017.groupby(['no_of_households_with_electricity', 'no_of_households_with_pressure_lamp', 'no_of_households_with_lantern', 'no_of_households_with_tin_lamp', 'no_of_households_with_gas_lamp', 'no_of_households_with_fuel_wood', 'no_of_households_with_solar','no_of_households_with_other'])['county'].sum().reset_index()
Energy1_2017 = Energy_2017.groupby(['county'])['no_of_households_with_electricity', 'no_of_households_with_pressure_lamp', 'no_of_households_with_lantern', 'no_of_households_with_tin_lamp', 'no_of_households_with_gas_lamp', 'no_of_households_with_fuel_wood', 'no_of_households_with_solar','no_of_households_with_other', 'households'].sum().reset_index()
Energy1_2017
#g1 = df1.groupby( [ "Name", "City"] ).count().reset_index()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

             county  ...  households
0           Baringo  ...      110649
1             Bomet  ...      174914
2           Bungoma  ...      270824
3             Busia  ...      154225
4   Elgeyo Marakwet  ...       77555
5              Embu  ...      131683
6           Garissa  ...       98590
7          Homa Bay  ...      206255
8            Isiolo  ...       31326
9           Kajiado  ...      173464
10         Kakamega  ...      355679
11          Kericho  ...      127581
12           Kiambu  ...      482450
13           Kilifi  ...      199764
14        Kirinyaga  ...      154220
15            Kisii  ...      269683
16           Kisumu  ...      226719
17            Kitui  ...      205491
18            Kwale  ...      122047
19         Laikipia  ...      103114
20             Lamu  ...       22184
21         Machakos  ...      264500
22          Makueni  ...      186478
23          Mandera  ...      125497
24         Marsabit  ...       56941
25             Meru  ...      381026
26           Migori  ...      180211
27          Mombasa  ...      268700
28          Muranga  ...      242490
29          Nairobi  ...      985016
30           Nakuru  ...      409836
31            Nandi  ...      154073
32            Narok  ...      169220
33          Nyamira  ...      106385
34        Nyandarua  ...      143879
35            Nyeri  ...      201703
36          Samburu  ...       47354
37            Siaya  ...      199034
38     Taita Taveta  ...       71090
39       Tana River  ...       47414
40    Tharaka Nithi  ...       27393
41      Trans Nzoia  ...      170117
42          Turkana  ...      123191
43      Uasin Gishu  ...      202291
44           Vihiga  ...      123347
45            Wajir  ...       88574
46       West Pokot  ...       93777

[47 rows x 10 columns]

In [ ]:
#overall % elect
(Energy_2020['no_of_households_with_electricity'] +Energy_2020['no_of_households_with_solar']).sum()/Energy_2020['households'].sum()

0.27210475784886645

Having carried out the above steps, it was observed that the two datasets were in fact the same original dataset based on 2011 data that had undergone cleaning. Additional research and data sourcing was carried out and the result was the adoption of the following data into our analysis

# DATA PREPARATION 2

In [ ]:
# Energy data from 2009
Energy_2009 = pd.read_csv('kenya-access-to-electricity-rates-per-county.csv')
Energy_2009.head()

  Country          Counties  Access to electricity
0   Kenya  National Average                   23.0
1   Kenya           Baringo                    9.6
2   Kenya             Bomet                    4.3
3   Kenya           Bungoma                    4.5
4   Kenya             Busia                    6.0

In [ ]:
# Making the above consistent with the previous data
Energy_2009.rename(columns= {'Counties': 'County', 'Access to electricity': 'percent_access_to_electricity' }, inplace = True)
Energy_2009.columns = Energy_2009.columns.str.strip().str.lower()
Energy_2009.head()

  country            county  percent_access_to_electricity
0   Kenya  National Average                           23.0
1   Kenya           Baringo                            9.6
2   Kenya             Bomet                            4.3
3   Kenya           Bungoma                            4.5
4   Kenya             Busia                            6.0

In [ ]:
# Loading the world bank datasets into the environment

Source = pd.read_csv('share-elec-by-source.csv')
Fossil_Fuels = pd.read_csv('share-electricity-fossil-fuels.csv')
Carbon = pd.read_csv('share-electricity-low-carbon.csv')
Renewables = pd.read_csv('share-electricity-renewables.csv')
Electricity_access = pd.read_csv('share-of-the-population-with-access-to-electricity.csv')

In [ ]:
# Previewing the datasets above
Source.head()

        Entity Code  ...  Hydro (% electricity)  Other renewables (% electricity)
0  Afghanistan  AFG  ...              66.809422                               0.0
1  Afghanistan  AFG  ...              84.121622                               0.0
2  Afghanistan  AFG  ...              80.786026                               0.0
3  Afghanistan  AFG  ...              67.092652                               0.0
4  Afghanistan  AFG  ...              63.199105                               0.0

[5 rows x 11 columns]

In [ ]:
Fossil_Fuels.head()

        Entity Code  Year  Fossil fuels (% electricity)
0  Afghanistan  AFG  2000                     33.190578
1  Afghanistan  AFG  2001                     15.878378
2  Afghanistan  AFG  2002                     19.213974
3  Afghanistan  AFG  2003                     32.907348
4  Afghanistan  AFG  2004                     36.800895

In [ ]:
Carbon.head()

        Entity Code  Year  Low-carbon electricity (% electricity)
0  Afghanistan  AFG  2000                               66.809422
1  Afghanistan  AFG  2001                               84.121622
2  Afghanistan  AFG  2002                               80.786026
3  Afghanistan  AFG  2003                               67.092652
4  Afghanistan  AFG  2004                               63.199105

In [ ]:
Renewables.head()

        Entity Code  Year  Renewables (% electricity)
0  Afghanistan  AFG  2000                   66.809422
1  Afghanistan  AFG  2001                   84.121622
2  Afghanistan  AFG  2002                   80.786026
3  Afghanistan  AFG  2003                   67.092652
4  Afghanistan  AFG  2004                   63.199105

In [ ]:
Electricity_access.head()

        Entity Code  Year  Access to electricity (% of population)
0  Afghanistan  AFG  1990                                     0.01
1  Afghanistan  AFG  1991                                     0.01
2  Afghanistan  AFG  1992                                     0.01
3  Afghanistan  AFG  1993                                     0.01
4  Afghanistan  AFG  1994                                     0.01

In [ ]:
# All data sets have values from 2000 that include all countries in the world.
# We'll need to access only data relative to Kenya
Source = Source[Source.Entity == 'Kenya']
Fossil_Fuels = Fossil_Fuels[Fossil_Fuels.Entity == 'Kenya']
Carbon = Carbon[Carbon.Entity == 'Kenya']
Renewables = Renewables[Renewables.Entity == 'Kenya']
Electricity_access = Electricity_access[Electricity_access.Entity == 'Kenya']

In [ ]:
# We'll also drop the irrelevant column Code
Source.drop('Code', axis= 1, inplace=True)
Fossil_Fuels.drop('Code', axis= 1, inplace=True)
Carbon.drop('Code', axis= 1, inplace= True)
Renewables.drop('Code', axis= 1, inplace= True)
Electricity_access.drop('Code', axis= 1, inplace=True)

In [ ]:
# Previewing the data
Source.head()

     Entity  Year  ...  Hydro (% electricity)  Other renewables (% electricity)
2600  Kenya  2000  ...              32.363098                         18.376912
2601  Kenya  2001  ...              51.796212                         17.330721
2602  Kenya  2002  ...              64.983165                         14.772727
2603  Kenya  2003  ...              63.299333                         21.635936
2604  Kenya  2004  ...              52.081423                         24.775353

[5 rows x 10 columns]

In [ ]:
Fossil_Fuels.head()

     Entity  Year  Fossil fuels (% electricity)
2245  Kenya  2000                     49.259990
2246  Kenya  2001                     30.873068
2247  Kenya  2002                     20.244108
2248  Kenya  2003                     15.064731
2249  Kenya  2004                     23.143224

In [ ]:
Carbon.head()

     Entity  Year  Low-carbon electricity (% electricity)
2600  Kenya  2000                               50.740010
2601  Kenya  2001                               69.126932
2602  Kenya  2002                               79.755892
2603  Kenya  2003                               84.935269
2604  Kenya  2004                               76.856776

In [ ]:
Renewables.head()

     Entity  Year  Renewables (% electricity)
2600  Kenya  2000                   50.740010
2601  Kenya  2001                   69.126932
2602  Kenya  2002                   79.755892
2603  Kenya  2003                   84.935269
2604  Kenya  2004                   76.856776

In [ ]:
Electricity_access.head()

     Entity  Year  Access to electricity (% of population)
3159  Kenya  1990                                 3.318390
3160  Kenya  1991                                 4.614890
3161  Kenya  1992                                 5.910881
3162  Kenya  1993                                10.900000
3163  Kenya  1994                                 8.490625

In [ ]:
# Consistency in columns
Source.columns = ['Entity', 'Year', 'Coal_percent_of_electricity', 'Oil_percent_of_electricity', 'Gas_percent_of_electricity', 'Nuclear_percent_of_electricity', 'Solar_percent_of_electricity',
                  'Wind_percent_of_electricity', 'Hydro_percent_of_electricity', 'Other_renewables_percent_of_electricity']
Fossil_Fuels.columns = ['Entity', 'Year', 'Fossil_Fuels_percent_of_electricity']
Carbon.columns = ['Entity', 'Year', 'Low_carbon_percent_of_electricity']
Renewables.columns = ['Entity', 'Year', 'Renewables_percent_of_electricity']
Electricity_access.columns = ['Entity', 'Year', 'percent_access_to_electricity']

# DATA CLEANING 2

In [ ]:
#dropping fossil table as it's the same as the Oil % column in Source table.
#dropping Carbon table as it's the same as the renewables table.
#Appending renewables to t
Source.head()

     Entity  ...  Other_renewables_percent_of_electricity
2600  Kenya  ...                                18.376912
2601  Kenya  ...                                17.330721
2602  Kenya  ...                                14.772727
2603  Kenya  ...                                21.635936
2604  Kenya  ...                                24.775353

[5 rows x 10 columns]

In [ ]:
Renewables.head()

     Entity  Year  Renewables_percent_of_electricity
2600  Kenya  2000                          50.740010
2601  Kenya  2001                          69.126932
2602  Kenya  2002                          79.755892
2603  Kenya  2003                          84.935269
2604  Kenya  2004                          76.856776

In [ ]:
Electricity_access.head()

     Entity  Year  percent_access_to_electricity
3159  Kenya  1990                       3.318390
3160  Kenya  1991                       4.614890
3161  Kenya  1992                       5.910881
3162  Kenya  1993                      10.900000
3163  Kenya  1994                       8.490625